RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Src/stm32u5xx_hal_uart_ex.c
  /* Check that a Rx process is not already ongoing */
  if (huart->RxState == HAL_UART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return HAL_ERROR;
    }

    __HAL_LOCK(huart);

    /* Set Reception type to reception till IDLE Event*/
    huart->ReceptionType = HAL_UART_RECEPTION_TOIDLE;

    status =  UART_Start_Receive_IT(huart, pData, Size);

    /* Check Rx process has been successfully started */
    if (status == HAL_OK)
    {
      if (huart->ReceptionType == HAL_UART_RECEPTION_TOIDLE)
      {
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_IDLEF);
        ATOMIC_SET_BIT(huart->Instance->CR1, USART_CR1_IDLEIE);
      }
      else
      {
        /* In case of errors already pending when reception is started,
           Interrupts may have already been raised and lead to reception abortion.
           (Overrun error for instance).
           In such case Reception Type has been reset to HAL_UART_RECEPTION_STANDARD. */
        status = HAL_ERROR;
      }
    }

    return status;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Receive an amount of data in DMA mode till either the expected number
  *        of data is received or an IDLE event occurs.
  * @note  Reception is initiated by this function call. Further progress of reception is achieved thanks
  *        to DMA services, transferring automatically received data elements in user reception buffer and
  *        calling registered callbacks at half/end of reception. UART IDLE events are also used to consider
  *        reception phase as ended. In all cases, callback execution will indicate number of received data elements.
  * @note  When the UART parity is enabled (PCE = 1), the received data contain
  *        the parity bit (MSB position).
  * @note  When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *        the received data is handled as a set of uint16_t. In this case, Size must indicate the number
  *        of uint16_t available through pData.
  * @param huart UART handle.
  * @param pData Pointer to data buffer (uint8_t or uint16_t data elements).
  * @param Size  Amount of data elements (uint8_t or uint16_t) to be received.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UARTEx_ReceiveToIdle_DMA(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size)
{
  HAL_StatusTypeDef status;

  /* Check that a Rx process is not already ongoing */
  if (huart->RxState == HAL_UART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return HAL_ERROR;
    }

    __HAL_LOCK(huart);

    /* Set Reception type to reception till IDLE Event*/
    huart->ReceptionType = HAL_UART_RECEPTION_TOIDLE;

    status =  UART_Start_Receive_DMA(huart, pData, Size);

    /* Check Rx process has been successfully started */
    if (status == HAL_OK)
    {
      if (huart->ReceptionType == HAL_UART_RECEPTION_TOIDLE)
      {
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_IDLEF);
        ATOMIC_SET_BIT(huart->Instance->CR1, USART_CR1_IDLEIE);
      }
      else
      {
        /* In case of errors already pending when reception is started,
           Interrupts may have already been raised and lead to reception abortion.
           (Overrun error for instance).
           In such case Reception Type has been reset to HAL_UART_RECEPTION_STANDARD. */
        status = HAL_ERROR;
      }
    }

    return status;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Set autonomous mode Configuration.
  * @param huart     UART handle.
  * @param sConfig   Autonomous mode structure parameters.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UARTEx_SetConfigAutonomousMode(UART_HandleTypeDef *huart, UART_AutonomousModeConfTypeDef *sConfig)
{
  uint32_t tmpreg;

  if (huart->gState == HAL_UART_STATE_READY)
  {
    /* Check the parameters */
    assert_param(IS_UART_TRIGGER_POLARITY(sConfig->TriggerPolarity));
    assert_param(IS_UART_IDLE_FRAME_TRANSMIT(sConfig->IdleFrame));
    assert_param(IS_UART_TX_DATA_SIZE(sConfig->DataSize));
    if (IS_LPUART_INSTANCE(huart->Instance))
    {
      assert_param(IS_LPUART_TRIGGER_SELECTION(sConfig->TriggerSelection));
    }
    else
    {
      assert_param(IS_UART_TRIGGER_SELECTION(sConfig->TriggerSelection));
    }

    /* Process Locked */
    __HAL_LOCK(huart);

    huart->gState = HAL_UART_STATE_BUSY;

    /* Disable UART */
    __HAL_UART_DISABLE(huart);

    /* Disable Transmitter */
    CLEAR_BIT(huart->Instance->CR1, USART_CR1_TE);

    /* Clear AUTOCR register */
    CLEAR_REG(huart->Instance->AUTOCR);

    /* UART AUTOCR Configuration */
    tmpreg = ((sConfig->DataSize << USART_AUTOCR_TDN_Pos) | (sConfig->TriggerPolarity) | \
              (sConfig->AutonomousModeState) | (sConfig->IdleFrame) | \
              (sConfig->TriggerSelection << USART_AUTOCR_TRIGSEL_Pos));

    WRITE_REG(huart->Instance->AUTOCR, tmpreg);

    /* Enable UART */
    __HAL_UART_ENABLE(huart);

    huart->gState = HAL_UART_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(huart);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Get autonomous mode Configuration.
  * @param huart     UART handle.
  * @param sConfig   Autonomous mode structure parameters.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UARTEx_GetConfigAutonomousMode(UART_HandleTypeDef *huart, UART_AutonomousModeConfTypeDef *sConfig)
{
  uint32_t tmpreg;

  /* Read AUTOCR register */
  tmpreg = READ_REG(huart->Instance->AUTOCR);

  /* Fill Autonomous structure parameter */
  sConfig->AutonomousModeState = (tmpreg & USART_AUTOCR_TRIGEN);
  sConfig->TriggerSelection = ((tmpreg & USART_AUTOCR_TRIGSEL) >> USART_AUTOCR_TRIGSEL_Pos);
  sConfig->TriggerPolarity = (tmpreg & USART_AUTOCR_TRIGPOL);
  sConfig->IdleFrame = (tmpreg & USART_AUTOCR_IDLEDIS);
  sConfig->DataSize = (tmpreg & USART_AUTOCR_TDN);

  return HAL_OK;
}

/**
  * @brief Clear autonomous mode Configuration.
  * @param huart  UART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UARTEx_ClearConfigAutonomousMode(UART_HandleTypeDef *huart)
{
  if (huart->gState == HAL_UART_STATE_READY)
  {
    /* Process Locked */
    __HAL_LOCK(huart);

    huart->gState = HAL_UART_STATE_BUSY;

    /* Disable UART */
    __HAL_UART_DISABLE(huart);

    /* Clear AUTOCR register */
    CLEAR_REG(huart->Instance->AUTOCR);

